results-shopcart-harness_2_0_0-native-run/result-2026-01-05-13:34:13/wrk2_results_20260105_133414.txt
Running 30s test @ http://shopcart:8001
  16 threads and 16 connections
  Thread calibration: mean lat.: 1.582ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.571ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.598ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.653ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.872ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.838ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.819ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.695ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.593ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.554ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.546ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.908ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.866ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.775ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.683ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.522ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.82ms  771.84us  20.13ms   84.82%
    Req/Sec    52.44     51.90   200.00     83.12%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.77ms
 75.000%    2.13ms
 90.000%    2.49ms
 99.000%    3.73ms
 99.900%   11.65ms
 99.990%   18.78ms
 99.999%   20.14ms
100.000%   20.14ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.302     0.000000            1         1.00
       1.117     0.100000         1598         1.11
       1.327     0.200000         3202         1.25
       1.495     0.300000         4802         1.43
       1.635     0.400000         6396         1.67
       1.766     0.500000         7996         2.00
       1.833     0.550000         8793         2.22
       1.899     0.600000         9591         2.50
       1.970     0.650000        10393         2.86
       2.049     0.700000        11206         3.33
       2.127     0.750000        11981         4.00
       2.171     0.775000        12384         4.44
       2.217     0.800000        12782         5.00
       2.273     0.825000        13190         5.71
       2.335     0.850000        13580         6.67
       2.409     0.875000        13975         8.00
       2.447     0.887500        14178         8.89
       2.493     0.900000        14381        10.00
       2.545     0.912500        14577        11.43
       2.595     0.925000        14775        13.33
       2.667     0.937500        14978        16.00
       2.707     0.943750        15076        17.78
       2.749     0.950000        15174        20.00
       2.791     0.956250        15273        22.86
       2.863     0.962500        15374        26.67
       2.953     0.968750        15476        32.00
       3.013     0.971875        15524        35.56
       3.091     0.975000        15572        40.00
       3.153     0.978125        15622        45.71
       3.227     0.981250        15673        53.33
       3.337     0.984375        15724        64.00
       3.409     0.985938        15748        71.11
       3.527     0.987500        15772        80.00
       3.639     0.989062        15797        91.43
       3.779     0.990625        15822       106.67
       4.063     0.992188        15847       128.00
       4.179     0.992969        15859       142.22
       4.379     0.993750        15872       160.00
       4.635     0.994531        15884       182.86
       4.815     0.995313        15897       213.33
       5.175     0.996094        15909       256.00
       5.479     0.996484        15915       284.44
       5.619     0.996875        15922       320.00
       6.111     0.997266        15928       365.71
       6.551     0.997656        15934       426.67
       7.311     0.998047        15940       512.00
       7.559     0.998242        15943       568.89
       8.479     0.998437        15947       640.00
       9.767     0.998633        15950       731.43
      11.559     0.998828        15953       853.33
      12.247     0.999023        15956      1024.00
      12.447     0.999121        15957      1137.78
      13.127     0.999219        15959      1280.00
      13.927     0.999316        15961      1462.86
      14.407     0.999414        15962      1706.67
      14.879     0.999512        15964      2048.00
      14.879     0.999561        15964      2275.56
      15.711     0.999609        15965      2560.00
      17.055     0.999658        15966      2925.71
      17.199     0.999707        15967      3413.33
      17.439     0.999756        15968      4096.00
      17.439     0.999780        15968      4551.11
      17.439     0.999805        15968      5120.00
      18.783     0.999829        15969      5851.43
      18.783     0.999854        15969      6826.67
      18.943     0.999878        15970      8192.00
      18.943     0.999890        15970      9102.22
      18.943     0.999902        15970     10240.00
      18.943     0.999915        15970     11702.86
      18.943     0.999927        15970     13653.33
      20.143     0.999939        15971     16384.00
      20.143     1.000000        15971          inf
#[Mean    =        1.824, StdDeviation   =        0.772]
#[Max     =       20.128, Total count    =        15971]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24003 requests in 29.97s, 12.25MB read
  Non-2xx or 3xx responses: 11961
Requests/sec:    800.81
Transfer/sec:    418.47KB